# taking care of missing values

In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

##### None is treated as NA

In [3]:
string_data[0] = None

In [4]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [5]:
from numpy import nan as NA

In [6]:
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [7]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data = pd.DataFrame([[1., 6.5, 3.], [1, NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
cleaned = data.dropna()

In [11]:
cleaned

     0    1    2
0  1.0  6.5  3.0

##### dropping the rows with all NA

In [12]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data[4] = NA

In [14]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [15]:
data.dropna(axis = 1, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
df = pd.DataFrame(np.random.randn(7, 3))

In [17]:
df.iloc[:4, 1] = NA

In [18]:
df.iloc[:2, 2] = NA

In [19]:
df

          0         1         2
0 -0.260385       NaN       NaN
1  0.026002       NaN       NaN
2  0.650507       NaN -0.394357
3  0.471208       NaN -0.050604
4 -0.429447 -0.893154  0.597051
5 -0.544958 -0.493583 -1.256095
6 -1.772149  1.207015 -1.164063

In [20]:
df.dropna()

          0         1         2
4 -0.429447 -0.893154  0.597051
5 -0.544958 -0.493583 -1.256095
6 -1.772149  1.207015 -1.164063

In [21]:
df.dropna(thresh = 2)

          0         1         2
2  0.650507       NaN -0.394357
3  0.471208       NaN -0.050604
4 -0.429447 -0.893154  0.597051
5 -0.544958 -0.493583 -1.256095
6 -1.772149  1.207015 -1.164063

# Filling in the missing data

In [22]:
df.fillna(0)

          0         1         2
0 -0.260385  0.000000  0.000000
1  0.026002  0.000000  0.000000
2  0.650507  0.000000 -0.394357
3  0.471208  0.000000 -0.050604
4 -0.429447 -0.893154  0.597051
5 -0.544958 -0.493583 -1.256095
6 -1.772149  1.207015 -1.164063

In [23]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.260385  0.500000  0.000000
1  0.026002  0.500000  0.000000
2  0.650507  0.500000 -0.394357
3  0.471208  0.500000 -0.050604
4 -0.429447 -0.893154  0.597051
5 -0.544958 -0.493583 -1.256095
6 -1.772149  1.207015 -1.164063

##### modifying the existing object

In [24]:
_ = df.fillna(0, inplace = True)
df

          0         1         2
0 -0.260385  0.000000  0.000000
1  0.026002  0.000000  0.000000
2  0.650507  0.000000 -0.394357
3  0.471208  0.000000 -0.050604
4 -0.429447 -0.893154  0.597051
5 -0.544958 -0.493583 -1.256095
6 -1.772149  1.207015 -1.164063

In [25]:
df = pd.DataFrame(np.random.randn(6, 3))

In [26]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA

In [27]:
df

          0         1         2
0  0.926462  2.247826  0.379200
1 -1.680805  1.356075  0.851893
2  0.334069       NaN -0.128527
3 -0.438530       NaN -0.607307
4 -0.961751       NaN       NaN
5  0.249899       NaN       NaN

##### repeating the last detail

In [28]:
df.fillna(method = 'ffill')

          0         1         2
0  0.926462  2.247826  0.379200
1 -1.680805  1.356075  0.851893
2  0.334069  1.356075 -0.128527
3 -0.438530  1.356075 -0.607307
4 -0.961751  1.356075 -0.607307
5  0.249899  1.356075 -0.607307

In [29]:
df.fillna(method = 'ffill', limit = 2)

          0         1         2
0  0.926462  2.247826  0.379200
1 -1.680805  1.356075  0.851893
2  0.334069  1.356075 -0.128527
3 -0.438530  1.356075 -0.607307
4 -0.961751       NaN -0.607307
5  0.249899       NaN -0.607307

##### using mean or median

In [30]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [31]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# Data Transformation

In [32]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [33]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [34]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [35]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [36]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

##### to keep the last occurance

In [37]:
data.drop_duplicates(['k1', 'k2'], keep = 'last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

# Transforming data using a function or mapping

In [38]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [39]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [40]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [41]:
data['animal'] = lowercased.map(meat_to_animal)

In [42]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [43]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

# Replacing Values

In [44]:
data = pd.Series([1., -999., 2., -999, -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [45]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [46]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [47]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [48]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

# Renaming Axis Indexes

In [49]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), index = ['Ohio', 'Colorado', 'New York'], columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [50]:
transform = lambda x: x[:4].upper()

In [51]:
data.index = data.index.map(transform)

In [52]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

##### str.title is for first letter capitalization

In [53]:
data.rename(index = str.title, columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [54]:
data.rename(index = {'OHIO': 'INDIANA'}, columns = {'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [55]:
data.rename(index = {'OHIO': 'INDIANA'}, inplace = True)

In [56]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

# Discretization and Binning

In [57]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [58]:
bins = [18, 25, 35, 60, 100]

##### cut to divide into bins

In [59]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

##### each category has a code

In [60]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [61]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [62]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

##### changing the brackets

In [63]:
pd.cut(ages, [18, 26, 36, 61, 100], right = False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

##### bin names

In [64]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [65]:
pd.cut(ages, bins, labels = group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

##### passing number of bins only

In [66]:
data = np.random.rand(20)

In [67]:
data

array([0.13844566, 0.63449522, 0.24454231, 0.05290593, 0.23290585,
       0.21592624, 0.25934384, 0.39715858, 0.20651081, 0.31380785,
       0.5987239 , 0.78468843, 0.1534573 , 0.45020875, 0.92362699,
       0.41123744, 0.97188951, 0.74419519, 0.83176701, 0.03969782])

In [68]:
# precision for decimal precision fixed to 2
pd.cut(data, 4, precision = 2)

[(0.039, 0.27], (0.51, 0.74], (0.039, 0.27], (0.039, 0.27], (0.039, 0.27], ..., (0.27, 0.51], (0.74, 0.97], (0.74, 0.97], (0.74, 0.97], (0.039, 0.27]]
Length: 20
Categories (4, interval[float64]): [(0.039, 0.27] < (0.27, 0.51] < (0.51, 0.74] < (0.74, 0.97]]

##### qcut

In [69]:
data = np.random.randn(1000)

In [70]:
cats = pd.qcut(data, 4) # cutting into quartiles
cats

[(-4.253, -0.675], (0.606, 2.747], (-0.675, -0.0667], (-0.0667, 0.606], (0.606, 2.747], ..., (-4.253, -0.675], (0.606, 2.747], (-0.675, -0.0667], (-0.675, -0.0667], (-0.675, -0.0667]]
Length: 1000
Categories (4, interval[float64]): [(-4.253, -0.675] < (-0.675, -0.0667] < (-0.0667, 0.606] < (0.606, 2.747]]

In [71]:
pd.value_counts(cats)

(0.606, 2.747]       250
(-0.0667, 0.606]     250
(-0.675, -0.0667]    250
(-4.253, -0.675]     250
dtype: int64

##### passing our own quartiles

In [72]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.251, -0.0667], (1.258, 2.747], (-1.251, -0.0667], (-0.0667, 1.258], (-0.0667, 1.258], ..., (-1.251, -0.0667], (1.258, 2.747], (-1.251, -0.0667], (-1.251, -0.0667], (-1.251, -0.0667]]
Length: 1000
Categories (4, interval[float64]): [(-4.253, -1.251] < (-1.251, -0.0667] < (-0.0667, 1.258] < (1.258, 2.747]]

##### Detecting and Filtering Outlines

In [73]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [74]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.001257     0.053053     0.006957    -0.025581
std       1.010870     1.005572     0.953459     0.975623
min      -2.840173    -3.221508    -3.175343    -3.365685
25%      -0.728905    -0.632282    -0.632281    -0.674567
50%       0.006090     0.038572     0.025034    -0.012868
75%       0.736971     0.759915     0.668165     0.649969
max       3.187245     3.154195     2.852423     2.852782

In [75]:
col = data[2]

In [76]:
col[np.abs(col) > 3]

536   -3.175343
Name: 2, dtype: float64

In [77]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
178  3.187245 -2.232261  1.625974  0.544461
268  0.332930  3.154195  0.425079  0.804362
276  0.876167 -3.221508  0.088976  1.334400
536 -1.165444 -0.202413 -3.175343  0.163076
685  0.734428 -1.018586 -0.696068 -3.365685
818 -2.043753  0.707425 -0.136349 -3.145855

##### np.sign() returns -1 or 1

In [78]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [79]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.001444     0.053120     0.007133    -0.025069
std       1.010296     1.004409     0.952889     0.973980
min      -2.840173    -3.000000    -3.000000    -3.000000
25%      -0.728905    -0.632282    -0.632281    -0.674567
50%       0.006090     0.038572     0.025034    -0.012868
75%       0.736971     0.759915     0.668165     0.649969
max       3.000000     3.000000     2.852423     2.852782

In [80]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0 -1.0
1  1.0  1.0  1.0  1.0
2 -1.0  1.0  1.0 -1.0
3 -1.0 -1.0 -1.0  1.0
4  1.0  1.0  1.0  1.0

##### Permutation and Random Sampling

In [81]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [82]:
sampler = np.random.permutation(5)
sampler

array([1, 3, 4, 2, 0])

In [83]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
4  16  17  18  19
2   8   9  10  11
0   0   1   2   3

##### choosing any 3 random subset without replacement

In [84]:
df.sample(n = 3)

    0   1   2   3
1   4   5   6   7
2   8   9  10  11
4  16  17  18  19

##### with replacement

In [85]:
choices = pd.Series([5, 7, -1, 6, 4])

In [86]:
draws = choices.sample(n = 10, replace = True)
draws

1    7
3    6
2   -1
3    6
0    5
2   -1
0    5
0    5
1    7
0    5
dtype: int64

##### Dummy Variables

In [87]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                  'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [88]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

##### adding prefix

In [89]:
dummies = pd.get_dummies(df['key'], prefix = 'key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [90]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

##### looking a more complex example

In [91]:
mnames = ['movie_id', 'title', 'genres']

In [92]:
movies = pd.read_table('pydata-book-2nd-edition/datasets/movielens/movies.dat', sep = '::', header = None, names = mnames)

C:\Users\Aditya\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.
C:\Users\Aditya\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

In [93]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

##### analysing genres

In [94]:
all_genres = []

In [95]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [96]:
genres = pd.unique(all_genres)

In [97]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [98]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [99]:
dummies = pd.DataFrame(zero_matrix, columns = genres)
dummies[:5]

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [100]:
gen = movies.genres[0]
gen

"Animation|Children's|Comedy"

In [101]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [102]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [103]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [104]:
movies_windic = movies.join(dummies.add_prefix('Genres_'))

In [105]:
movies_windic.iloc[0]

movie_id                                        1
title                            Toy Story (1995)
genres                Animation|Children's|Comedy
Genres_Animation                                1
Genres_Children's                               1
Genres_Comedy                                   1
Genres_Adventure                                0
Genres_Fantasy                                  0
Genres_Romance                                  0
Genres_Drama                                    0
Genres_Action                                   0
Genres_Crime                                    0
Genres_Thriller                                 0
Genres_Horror                                   0
Genres_Sci-Fi                                   0
Genres_Documentary                              0
Genres_War                                      0
Genres_Musical                                  0
Genres_Mystery                                  0
Genres_Film-Noir                                0
Genres_Western                                  0
Name: 0, dtype: object

In [106]:
movies_windic[:5]

,movie_id,title,genres,Genres_Animation,Genres_Children's,Genres_Comedy,Genres_Adventure,Genres_Fantasy,Genres_Romance,Genres_Drama,...,Genres_Crime,Genres_Thriller,Genres_Horror,Genres_Sci-Fi,Genres_Documentary,Genres_War,Genres_Musical,Genres_Mystery,Genres_Film-Noir,Genres_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,1.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

##### combining cut and dummy varible functions

In [108]:
np.random.seed(12345)

In [109]:
values = np.random.rand(10)

In [110]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [111]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1.]

In [112]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

# String Manipulation

##### splitting and striping

In [113]:
vals = 'a,b, guido'

In [115]:
vals.split(',')

['a', 'b', ' guido']

In [118]:
pieces = [x.strip() for x in vals.split(',')]
pieces

['a', 'b', 'guido']

##### two colon delimiter

In [119]:
first, second, third = pieces

In [120]:
first + '::' + second + '::' + third

'a::b::guido'

In [121]:
'::'.join(pieces)

'a::b::guido'

##### locating substrings

In [123]:
'guido' in vals

True

In [124]:
vals.index(',')

1

In [126]:
vals.find(':') # index returns an exception because not present in the string

-1

In [128]:
vals.count(',')

2

In [130]:
vals.replace(',', '::')

'a::b:: guido'

In [131]:
vals.replace(',', '') # as delete function

'ab guido'

# Regular Expressions

In [132]:
import re

In [133]:
text = "foo    bar\t baz    \tqux"

In [134]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

##### using regex as a rsusable object

In [135]:
regex = re.compile('\s+')

In [136]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

##### findall

In [138]:
regex.findall(text)

['    ', '\t ', '    \t']

In [223]:
text = """Dave dave@google.com
Steve steve@google.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [224]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [225]:
regex = re.compile(pattern, flags = re.IGNORECASE)

In [226]:
regex.findall(text)

['dave@google.com', 'steve@google.com', 'rob@gmail.com', 'ryan@yahoo.com']

##### Search

In [227]:
m = regex.search(text)

In [228]:
m

In [229]:
text[m.start():m.end()]

'dave@google.com'

In [230]:
print(regex.match(text)) # to check only at begining

None

##### replacing

In [231]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

##### segment

In [232]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [233]:
regex = re.compile(pattern, flags = re.IGNORECASE)

In [234]:
m = regex.match('wesm@bright.net')

In [235]:
m.groups()

('wesm', 'bright', 'net')

In [236]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'google', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [237]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix:\3', text))

Dave Username: dave, Domain: google, Suffix:com
Steve Username: steve, Domain: google, Suffix:com
Rob Username: rob, Domain: gmail, Suffix:com
Ryan Username: ryan, Domain: yahoo, Suffix:com

##### Vectorized String Functions in pandas

In [238]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [239]:
data = pd.Series(data)

In [240]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [241]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [242]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [243]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [244]:
data.str.findall(pattern, flags = re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

##### get

In [245]:
matches = data.str.match(pattern, flags = re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [246]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [247]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

##### slicing

In [248]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object